CS19970929/030-TI-templ/firmware/startup/startup_stm32f0xx_gcc.S
.syntax unified
.cpu cortex-m0
.thumb

.global g_pfnVectors
.global Default_Handler
.global Reset_Handler

.equ APP_VECTOR_WORDS, 48
.equ RAM_VECTOR_BASE, 0x20000000
.equ RCC_APB2ENR, 0x40021018
.equ RCC_APB2ENR_SYSCFGEN, 0x00000001
.equ SYSCFG_CFGR1, 0x40010000
.equ SYSCFG_MEM_MODE_SRAM, 0x00000003

.word _sidata
.word _sdata
.word _edata
.word _sbss
.word _ebss

.section .text.Reset_Handler
.weak Reset_Handler
.type Reset_Handler, %function
Reset_Handler:
    /* Remap the application vector table before early startup code runs.
       The bootloader may leave pending interrupts enabled; on STM32F030 there
       is no VTOR, so any early exception would otherwise fall back to the
       bootloader vector table. */
    ldr r0, =g_pfnVectors
    ldr r1, =RAM_VECTOR_BASE
    movs r2, #APP_VECTOR_WORDS
0:
    ldr r3, [r0]
    str r3, [r1]
    adds r0, r0, #4
    adds r1, r1, #4
    subs r2, r2, #1
    bne 0b

    ldr r0, =RCC_APB2ENR
    ldr r1, [r0]
    ldr r2, =RCC_APB2ENR_SYSCFGEN
    orrs r1, r2
    str r1, [r0]

    ldr r0, =SYSCFG_CFGR1
    ldr r1, [r0]
    movs r2, #3
    bics r1, r2
    movs r2, #SYSCFG_MEM_MODE_SRAM
    orrs r1, r2
    str r1, [r0]

    ldr r0, =_sidata
    ldr r1, =_sdata
    ldr r2, =_edata
1:
    cmp r1, r2
    bcc 2f
    b 3f
2:
    ldr r3, [r0]
    str r3, [r1]
    adds r0, r0, #4
    adds r1, r1, #4
    b 1b
3:
    ldr r0, =_sbss
    ldr r1, =_ebss
    movs r2, #0
4:
    cmp r0, r1
    bcc 5f
    b 6f
5:
    str r2, [r0]
    adds r0, r0, #4
    b 4b
6:
    bl SystemInit
    bl main
7:
    b 7b

.section .text.Default_Handler,"ax",%progbits
.type Default_Handler, %function
Default_Handler:
    b .

.macro def_irq_handler handler
    .weak \handler
    .thumb_set \handler, Default_Handler
.endm

def_irq_handler NMI_Handler
def_irq_handler HardFault_Handler
def_irq_handler SVC_Handler
def_irq_handler PendSV_Handler
def_irq_handler SysTick_Handler
def_irq_handler WWDG_IRQHandler
def_irq_handler PVD_IRQHandler
def_irq_handler RTC_IRQHandler
def_irq_handler FLASH_IRQHandler
def_irq_handler RCC_IRQHandler
def_irq_handler EXTI0_1_IRQHandler
def_irq_handler EXTI2_3_IRQHandler
def_irq_handler EXTI4_15_IRQHandler
def_irq_handler TS_IRQHandler
def_irq_handler DMA1_Channel1_IRQHandler
def_irq_handler DMA1_Channel2_3_IRQHandler
def_irq_handler DMA1_Channel4_5_IRQHandler
def_irq_handler ADC1_COMP_IRQHandler
def_irq_handler TIM1_BRK_UP_TRG_COM_IRQHandler
def_irq_handler TIM1_CC_IRQHandler
def_irq_handler TIM2_IRQHandler
def_irq_handler TIM3_IRQHandler
def_irq_handler TIM6_DAC_IRQHandler
def_irq_handler TIM14_IRQHandler
def_irq_handler TIM15_IRQHandler
def_irq_handler TIM16_IRQHandler
def_irq_handler TIM17_IRQHandler
def_irq_handler I2C1_IRQHandler
def_irq_handler I2C2_IRQHandler
def_irq_handler SPI1_IRQHandler
def_irq_handler SPI2_IRQHandler
def_irq_handler USART1_IRQHandler
def_irq_handler USART2_IRQHandler
def_irq_handler CEC_IRQHandler

.section .isr_vector,"a",%progbits
.type g_pfnVectors, %object
g_pfnVectors:
    .word _estack
    .word Reset_Handler
    .word NMI_Handler
    .word HardFault_Handler
    .word 0
    .word 0
    .word 0
    .word 0
    .word 0
    .word 0
    .word 0
    .word SVC_Handler
    .word 0
    .word 0
    .word PendSV_Handler
    .word SysTick_Handler
    .word WWDG_IRQHandler
    .word PVD_IRQHandler
    .word RTC_IRQHandler
    .word FLASH_IRQHandler
    .word RCC_IRQHandler
    .word EXTI0_1_IRQHandler
    .word EXTI2_3_IRQHandler
    .word EXTI4_15_IRQHandler
    .word TS_IRQHandler
    .word DMA1_Channel1_IRQHandler
    .word DMA1_Channel2_3_IRQHandler
    .word DMA1_Channel4_5_IRQHandler
    .word ADC1_COMP_IRQHandler
    .word TIM1_BRK_UP_TRG_COM_IRQHandler
    .word TIM1_CC_IRQHandler
    .word TIM2_IRQHandler
    .word TIM3_IRQHandler
    .word TIM6_DAC_IRQHandler
    .word 0
    .word TIM14_IRQHandler
    .word TIM15_IRQHandler
    .word TIM16_IRQHandler
    .word TIM17_IRQHandler
    .word I2C1_IRQHandler
    .word I2C2_IRQHandler
    .word SPI1_IRQHandler
    .word SPI2_IRQHandler
    .word USART1_IRQHandler
    .word USART2_IRQHandler
    .word 0
    .word CEC_IRQHandler
    .word 0
.size g_pfnVectors, .-g_pfnVectors
